backend/app/models/user.rb

SELECT "users".* FROM "users"
---
  def self.distinct_ordered(attribute)
    distinct.pluck(attribute).compact.sort