backend/app/controllers/api/v1/users_controller.rb

  def index
    @users = User.filter_by_location(filter_params)

    render json: {
      users: @users.map { |user| user_data(user) }
---
SELECT "users".* FROM "users"